{
  "forward": [
      {
          "name": "Paschimottanasana",
          "smalldes": "Paschimottanasana is a seated forward bend yoga. Paschimottanasana involves intense stretching of both legs and the back of the body.",
          "compdes": "How to do\nSit up with the legs stretched out straight in front of you keeping the spine erect and toes flexed toward you. Breathing in, raise both arms above your head and stretch up. Breathing out, bend forward from the hip joints, chin moving toward the toes. \nKeep the spine erect focusing on moving forwards towards the toes, rather than down towards the knees. Place your hands on your legs, wherever they reach, without forcing. If you can, take hold of your toes and pull on them to help you go forward.\nBreathing in, lift your head slightly and lengthen your spine. Breathing out, gently move the navel towards the knees. Repeat this movement two or three times. Drop your head down and breathe deeply for 20-60 seconds. Stretch the arms out in front of you. Breathing in, with the strength of your arms, come back up to the sitting position. Breathe out and lower the arms.",
          "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
          "alt": "Paschimottanasana"
      },
    {
      "name": "KaranPeedasana",
      "smalldes": " KaranPeedasana is one of the advanced yoga poses which demands expertise over Plough pose and Shoulder Sand pose ",
      "compdes": "How to do\nLie down on your back, keep your hands at your side palm pointing towards the ground. First, inhale and then as you exhale raise your legs upwards in the sky’s direction; thus, achieving the pose of Sarvangasana (Shoulder Stand Pose).\nBend your legs over your head and touch the toes on the ground to shift Sarvangasana to Halasana (Plough Pose). Make sure your legs are parallel to your hands.Now raise your buttocks and bend the knees, hold them together till they reach the ground.\nAs your knees touch the ground, align them with the shoulders and place them next to your ears. Try to look towards your nose while practising Karnapidasana steps. Hold your body at least for 60 seconds.\nBenefits\nIt Stretches and Strengthens Muscles, Improves Body Posture, Improves The Function of Intercostal Muscles and Boosts Concentration Power.",
      "imgurl": "https://i.ibb.co/BgrJLJV/f1.jpg",
      "alt": "f1"
    },
    {
      "name": "Halasana",
      "smalldes": " It is a cultural Asana for the forward bending of the spine. ",
      "compdes": "How to do\nExhaling, raise both the legs upwards and continue taking them back beyond the head, in a semicircular arc, to touch the floor. The above movement should be smooth and non-jerky; the body supported by the hands; palms are facing down–pressing on the floor.Complete the above step in 3 seconds, while exhaling.\nMaintain this position for 30 seconds, with the breath suspended (final position).Return to starting position: Inhaling, in 3 seconds, lift the legs up and then carefully lower the back. Gently bring the legs back to starting position.\nBenefits\nHealthy effects on the nervous and the digestive system. Helps to relieve the pressure in the spine inflicted due to any improper posture. Improves circulation in the spinal cord. ",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Padahastasana",
      "smalldes": " Padahastasana is also known as Hand to Foot Pose. It is practiced during the Surya Namaskar .",
      "compdes": " How to do\nStand with the spine erect, feet together and hands beside the body. Relax your body . Distribute the weight of the body evenly on both feet . Slowly bend forward .While bending forward, imagine that the body has no bones or muscles\nDo not strain or force the body .Place the fingers underneath the toes or catch your ankles . Relax the back of your neck .Maintain your legs and knees active, they should remain straight .Take a few deep breaths.\nBenefits\nIt Improves the metabolism , improves concentration , massages the digestive organs.\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Padma Bakasana",
      "smalldes": "It  is an arm balancing pose as it exerts more pressure on the arms and wrist. ",
      "compdes": "How to do\nStart with squatting on the floor. Lay the hands flat on the ground with your fingers spread open, pointing outward in front of your feet. Keep your elbows slightly bent. \nSlowly press your arms and using your core abdominal muscles, raise your feet above the ground, keeping the knees bent. Do not exert excess pressure on the elbow while lifting the feet. Gradually lean forward, and adjust the knees to touch the upper arms near the armpits. \nYou are now supporting your entire body weight on both hands. Therefore, do not make haste in balancing your body. Look to the front and focus on a point and maintain steady breathing. This makes the final crane pose. Maintain this crane pose for five to ten seconds or more, depending on your comfort. To release the pose, exhale while slowly lowering the legs on the floor, and return to the squat position.\nBenefits\nIt might relieve stomach problems by enhancing the efficiency of the stomach and the intestines. Bakasana may increase the strength of the arms, wrists, shoulders and chest muscles.\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    }
  ],
  "backward": [
    {
      "name": "Chakrasana",
      "smalldes": "It is a backbending posture that opens up the chest, tones the thighs, abdomen and arms, and engages the whole body. ",
      "compdes": "How to do\nLie down on your back.Bend your knees with the heels touching your buttocks. Keep 12 inches of distance between your feet. Now lift your arms, bend the elbows and place your palms on the floor, above your shoulder on either side of your head. \nBreathe in and slowly lift your torso region, curving your back. Now straighten your arms and legs as much as possible, lightly dropping your head backwards. Hold this posture as long as you can comfortably, then come back to the starting position slowly by lowering your body and gently letting your head touch the floor. Lower the entire body this way, and then relax completely.\nBenefits\nIncreases energy and heat .Strengthens the arms, legs, spine, and abdomen .Opens the chest. Stretches the shoulders .Stretches the hip flexors and core.\n",
      "imgurl": "https://i.ibb.co/QmfXQdW/Chakrasana.jpg" ,
      "alt": "f2"
    },
    {
      "name": "Bhujangasana",
      "smalldes": " Cobra Pose increases the mobility of the spine, strengthens spinal support muscles, and can help relieve back pain. ",
      "compdes": "How to do\nPlace your palms flat on the ground directly under your shoulders. Bend your elbows straight back and hug them into your sides.Pause for a moment looking straight down at your mat with your neck in a neutral position. Anchor your pubic bone to the floor.\nInhale to lift your chest off the floor. Roll your shoulders back and keep your low ribs on the floor. Make sure your elbows continue hugging your sides. Don't let them wing out to either side.Keep your neck neutral. Don’t crank it up. Your gaze should stay on the floor.\nBenefits\nIt may help to stretch muscles in the chest, shoulders and abdominal area .It may help to soothe sciatica .It may help to enhance flexibility . It may rejuvenate the heart .\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Ustrasana",
      "smalldes": " Camel Pose or Ustrasana is a chest-opening backbend that is energizing and beneficia .",
      "compdes": "How to do \nInhaling, slowly lift the pelvis and push the body above the waist, outward and upward. Allow the neck to fall backwards gently. Complete the first two steps in 3 seconds, while inhaling. \nMaintain this posture, for 30 seconds, retaining the breath (final position). Return to starting position: Exhaling, in 3 seconds, gently draw back the upper torso and straighten the neck. Releasing the palm, attain kneeling position.\nBenefits\nIt Relieves back pain, improves posture by correcting drooping shoulders and rounded back ,improves breathing by opening up the chest; hence, good for asthmatics.",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Dhanur asana",
      "smalldes": " It helps to stretch the front part of the body, including the abdomen and chest, ankles, thighs, throat, groins and hip flexors.",
      "compdes": "How to do\nLie on your stomach with your feet apart, in line with your hips, and your arms by the side of your body.Fold your knees, take your hands backward, and hold your ankles.Breathe in, lift your chest off the ground, and pull your legs up and towards the back.\nLook straight ahead with a smile on your face.Keep the pose stable while paying attention to your breath. Your body is now curved and as taut as a bow.Continue to take long, deep breaths as you relax in this pose, but bend only as far as your body permits you to. Do not overdo the stretch.After 15 to 20 seconds, as you exhale, gently bring your legs and chest to the ground. Release the ankles and relax.\nBenefits\nIt opens up the chest, neck, and shoulder muscles and tones them. Dhanurasana stretches the foot and hand muscles, and tones the leg and arm muscles and strengthens them.\n",
      "imgurl": "https://i.ibb.co/Q9WVQC8/Dhanurasana.jpg",
      "alt": "f2"
    },
    {
      "name": "Shalabh asana",
      "smalldes": " Shalabh asana is a cultural asanas–for backward bending of the spine. ",
      "compdes": "How to do \nLie on your stomach and place your chin on the floor. Place the arms under the belly. The hands are under the thigh, palm facing downward. Breathe in and press the palms against the mat. \nKeep the legs straight and raise the legs as high as comfortable. Hold this pose and keep breathing. Breathe out, return to the starting position, and relax.\nBenefits\nStrengthens the lower back, pelvic organs, legs, hip joints and arms. Tones the sciatic nerves. Provide relief in backache, mild sciatica and slipped disc.",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Vrishchik aasan",
      "smalldes": " Scorpion Pose (Vrischikasana) is an advanced pose that you may begin to explore once you have developed sufficient core strength and shoulder mobility. ",
      "compdes": "How to do\nCome to a forearm stand  on your mat. Start to draw your spine into a large curve as you bend your knees and look forward slightly to lift your head without compressing the back of your neck (cervical spine).  \nIn forearm stand, your hips are pretty much over your shoulders. For your body to move into the classic C-shape of Scorpion, your hips and pelvis will begin to drop forward to hover over the top of your head. This is facilitated as you begin to curve your spine into extension. \nDraw your two big toes toward each other to touch as your knees remain separate and wide. Be mindful of collapsing into a backbend and compressing your lumbar, ensuring you are emphasizing strength and stability over flexibility. \nWith enough practice, you may eventually draw your toes toward the crown of your head. \nTo come out, neutralize your spine by straightening through your legs, passing through a forearm stand before you lower one leg down at a time to the floor. \nResting for a few moments in child’s pose can help counter the intensity of this backbend, drawing your spine into flexion.\nBenefits\nIt will strengthen your shoulders, arms, core, and back. It improves the flexibility of your spine and stretches your hip flexors and chest muscles.",
      "imgurl": "https://i.ibb.co/tpNDc1t/Vrishchikasana.jpg" ,
      "alt": "f2"
    },
    {
      "name": "Viparita asana",
      "smalldes": " This pose is among the yoga poses for sleep that improves the circulation of blood and helps it reach every part of the body. ",
      "compdes": "How to do\nLie down on a flat surface. Position yourself in a way that your tailbone is pointed at the base of the wall.Shimmy your hips as close as possible to the wall, then start walking your feet up the wall until your body forms an L shape.\nMake adjustments so that the posture feels relaxing, use a pillow under your head or a towel at the base of your back.\nBenefits\nIt helps relax your feet and provides benefits if you have leg pain. The posture helps improve sleep.\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Dimb aasan",
      "smalldes": "It is a back bending aasan. It is a advance level of aasan",
      "compdes": "How to do\nLie down on your back with feet apart, bend your knees and place your feet on the ground close to your body. Now bring your palms under your shoulders such that the fingers point towards the shoulders and the elbows are shoulder-width apart.\nInhale and press your palms firmly into the floor. Lift your shoulders and elbow firmly into the floor. Your Feet should be pressed firmly into the floor. Inhale and lift your hips up.The spine should be rolled up so that it may seem to resemble a semi-circular arch or wheel.\nStraighten out your arms and legs as much as possible so that the hips and chest may be pushed up. Hold this pose for at least 15-30 seconds. To go back to original, bend your elbows to lower your head and shoulders to the floor.Then bend your knees and bring your spine and hips back to the ground and relax.\nBenefits\nIt is Excellent for the heart , Good for infertility, asthma, and osteoporosis.",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    }
  ],
  "balancing": [
    {
      "name": "Sirsasana",
      "smalldes": " Sirsasana or the Headstand yoga pose is known as the king of all yoga poses or asanas. ",
      "compdes": "How to do\nLift your right foot to bring your right knee to your chest.Take a few deep breaths. When you feel steady, inhale and engage your core muscles.In a slow, controlled, movement exhale as you lift your left foot and bring your left knee into your chest alongside your right.\nBreathe deeply and keep your core engaged for as long as you remain in the headstand pose. You can to stay with knees tucked as you get comfortable with this balancing act. Don't rush lifting the legs up.\nBenefits\nIt also develops your core strength and challenges your whole body—from your shoulders to your toes, helping you improve your balance. ",
      "imgurl": "https://i.ibb.co/Xp9c7Tn/shirsasana.jpg",
      "alt": "f2"
    },
    {
      "name": "Omkar asana",
      "smalldes": " Omkarasana is a advanced level yoga pose that is performed in sitting position ",
      "compdes": "How to do\nStart seated. Wrap right leg around neck. Cross left leg around left arm and tucks toes under the right arm. Shift weight forward and balance on palms. Breathe calml.\nBenefits \nOmkarasana involves strength, Forward-Bend, Twist, Stretch, Balance.\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Padma bakasana",
      "smalldes": " It is an arm balancing pose as it exerts more pressure on the arms and wrist.",
      "compdes": " How to do\nStart with squatting on the floor. Lay the hands flat on the ground with your fingers spread open, pointing outward in front of your feet. Keep your elbows slightly bent. \nSlowly press your arms and using your core abdominal muscles, raise your feet above the ground, keeping the knees bent. Do not exert excess pressure on the elbow while lifting the feet. Gradually lean forward, and adjust the knees to touch the upper arms near the armpits. \nYou are now supporting your entire body weight on both hands. Therefore, do not make haste in balancing your body. Look to the front and focus on a point and maintain steady breathing. This makes the final crane pose. Maintain this crane pose for five to ten seconds or more, depending on your comfort. To release the pose, exhale while slowly lowering the legs on the floor, and return to the squat position.\nBenefits\nIt might relieve stomach problems by enhancing the efficiency of the stomach and the intestines. Bakasana may increase the strength of the arms, wrists, shoulders and chest muscles.\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Buck asana",
      "smalldes": " Crow Pose is often the first arm balance that yoga students tackle. ",
      "compdes": "How to do\nBend your knees slightly so that you can bring your palms flat on the floor, about shoulder distance apart.Plant your palms firmly on the mat about a foot in front of your feet. Spread your fingers wide and press into the top joint of each finger.\nBend your elbows straight back. Don't bend them into full Chaturanga arms, but head in that direction.Come up onto the balls of your feet and open your knees so that they line up with your upper arms. Place your knees on the backs of your upper arms.Begin to bring your weight forward into your hands, lifting your head as you go.\nCome up onto your tiptoes, lifting one foot and then the other off the floor.Engage the inner thighs for support while keeping the knees on the arms.Hug your feet toward your butt.Focus on the feeling of the body lifting. Avoid sinking into the pose, which can dump weight into the shoulders.To come out, exhale and transfer your weight back until your feet come back to the floor.\nBenefits\nCrow Pose strengthens the wrist, forearms, and abdomen while stretching your upper back.\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Sarvang asana",
      "smalldes": " The word ‘sarvanga’ means entire body. From the final position of asana, it can be deduced that it has a favourable effect on entire body .",
      "compdes": "How to do\nExhaling, raise high the legs together enough to make a right angle with the body. Keep the knees straight and the body above the hip-joint on the ground undisturbed.At this stage, still exhaling, raise the arms and hold the waist and push the body up as far as possible. Put all the body weight on the arms and rest on the elbows, with the legs thrown upwards.\nWhen this position is firmly secured, by careful manipulation, make an attempt to shift the hands slowly towards the waist, with the fingers extended to the back of the hip-bones and the thumbs pressed lightly on both sides of the navel.Set the chin in the jugular notch and place the full weight upon the shoulders, the neck and the back of the head (final position). Complete the above steps in 4 seconds, while exhaling.\nMaintain this pose as long as convenient, but not longer than two minutes, breathe normally slow, rhythmic and natural.Return to starting position: slowly bend the knees and then gently lower the hips towards the mat, supported by the hands in 4 seconds, while inhaling.\nRelease the hands from the back and assume the starting position.Take a few deep breaths and then rest a while, breath normally.\nBenefits\nIt Relief in the case of constipation, indigestion, headache, giddiness, neurasthenia.\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Handstand",
      "smalldes": " o do a handstand, your strength, mobility, balance, focus—everything—has to be aligned for you to achieve that completely weightless feeling ",
      "compdes": "How to do\nFirst things first, take your starting position. Sit down on the floor, facing the wall, and press your feet into the wall. Note the distance. Then flip over, and place your hands where your butt was, and your feet just in front of the wall. Your hands should be shoulder-width apart with fingers spread, and rotated forward, not inward. Essentially, you're in a downward-dog position. From here, practice distributing all your weight to the front of your feet, until you're on the tips of your toes.\nNext, start to slowly walk your feet up the wall behind you, with bent legs. Be sure to press more weight into your hands, and your whole foot into the wall. If your arms feel strong enough to handle the weight, keep walking up the wall, activating your arms, shoulders, upper chest, and core as you do so.\nContinue practicing walking up the wall until you feel confident, stable, and strong. Make sure you aren't hyperextending your elbows—keeping a slight bend limits the impact on the arm joints and also prevents the arms from caving in. Stabilize your entire body by pulling in your abdomen and engaging your core. To prevent your shoulders from coming up to your ears, lift from your lower belly. Your legs should always be engaged.\nLittle by little, walk your feet up the wall until your body makes a right angle, with knees slightly bent. \nNext step: lifting up those legs. Begin by lifting one leg up. Make sure your legs are rotated slightly inward—this helps keep the position of the spine vertical. And don't forget about your feet! They can be pointed, flexed, or a combination of both called “Barbie doll” feet, a.k.a. pointed feet with toes flexed back. Activated feet help to engage the entire body, just like standing upright. \nOnce you feel comfortable with one leg off the wall, it's time to move on to the next challenge. Extend both legs long and straight, with toes resting against the wall. You can either hold this pose for more practice, or, when you're ready, gently kick off that wall. The first time you do this, you may want to get an extra set of eyes (or hands) to help you out. Also, make sure the room is clear of furniture, just in case. If you feel unstable, just reach your feet back toward the wall. \nOnce you nail your handstand, practice gracefully falling out of it. One method is to try bending your knees and turning your fall into a cartwheel, Zaki says.\nBenefits\nHandstands get the blood circulating and give you an energy boost.\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Vrikshasana",
      "smalldes": " Vrikshasana is a standing pose. This asana is named so that the final posture looks like the shape of a tree .",
      "compdes": "How to do\nStand straight. Balance firmly on your left leg and lift your right leg. Bend your right leg at the knee. Now, place your right foot against the inside of your left thigh. Make sure the toes of your right foot facing downward. Join your palms in prayer at your chest level. Now, lift your arms over your head till your hands are stretched upward.\nHold the position while breathing deeply. Lower your arms to chest level and then separate your palms. Straighten your right leg and stand erect again. Repeat the posture with your right leg. \nBenefits\nIt improves balance and endurance, it may help in increasing stamina.\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Tadaasan",
      "smalldes": " Tadasana yoga pose forms the basis of most of the other standing asanas and works on the muscles in your core, back, legs, feet, and glutes. ",
      "compdes": "How to do\nStand with your feet slightly apart while keeping your feet balanced on both feet.Inhale and raise your arms above your head. Interlock your fingers with your palms facing up. Keep your gaze ahead.\nExhale and raise your shoulders towards your ears. Rollback your shoulders and lower your spine while straightening your posture and opening your chest.Relax all your muscles. Return to the starting position.\nBenefits\nTadasana asana is an excellent pose to improve your metabolism. This helps in keeping optimum weight.\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    }
  ],
  "streching": [
    {
      "name": "Hanumanasana",
      "smalldes": " Monkey Pose (Hanumanasana) is an intense stretch commonly referred to as the splits. ",
      "compdes": "How to do\nCome to a kneeling position with your thighs perpendicular to the floor. Exhale as you lower your hands to the floor in front of your knees, \"tenting\" them so you are up on your fingertips. \nBring your right leg straight out in front of you, the heel on the floor. Flex your right foot strongly.Begin to slide your right foot forward, keeping your right leg straight, as you also extend the left leg as straight as possible behind you. It helps to bring your right heel off your mat so that it slides more easily. \nKeep your hips facing forward. The toes of the left foot can be tucked under or you can release the top of that foot to the floor.Hold the pose for five to 10 breaths and then repeat on the other side.To come out of Monkey Pose, bend your right leg, come onto your left knee, and draw your right leg back toward your body.\nBenefits\nMonkey Pose stretches the hamstrings, groin muscles, and hip flexors.\n",
      "imgurl": "https://i.ibb.co/vvFYjYG/Hanumanasana.jpg" ,
      "alt": "f2"
    },
    {
      "name": "Tandav asana",
      "smalldes": "None",
      "compdes": "None",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    },
    {
      "name": "Shiva pose",
      "smalldes": " The pose builds balance, confidence, flexibility and strength.",
      "compdes": "How to do\nBegin standing. Inhale and bring the right knee toward the chest. Grasp the big toe with the first three fingers of the right hand. Exhale and extend the leg parallel to the floor.Grasp the outside of the right foot with the left hand.\nExhale and twist the torso to the right, extending the right arm to the right. Gaze over the right shoulder. Breathe while holding the pose.Inhale and carefully untwist and release.Change sides.\nBenefits\nIt Strengthens the legs and core, stretches and improves spinal flexibility ,Opens the hips, tones abdominal organs and improves digestion.\n",
      "imgurl": "https://i.ibb.co/VHghpYn/f2.jpg",
      "alt": "f2"
    }
  ]
}